from base import Setting, SettingSet
from django.forms.widgets import Textarea

FAQ_SET = SettingSet('faq', _('FAQ page'), _("Define the text in the about page. You can use markdown and some basic html tags."), 2000, True)

FAQ_PAGE_TEXT = Setting('FAQ_PAGE_TEXT',
u"""
**Често задавани въпроси (ЧЗВ)**

**С какво HowTo.bg е по-различен от обикновените форуми?**

HowTo.bg се различава по това че се фокусира върху намиране на отговор на зададените въпроси. Във форумите, се получава дискусия, в която хората свободно изразяват тяхното лично мнение, често субективно.

HowTo.bg се фокусира върху намирането на по-добрите и правилни отговори, като намалява до минимум разсейващите елементи.

**Какви въпроси мога да задавам в HowTo.bg?**

Най-важното – въпроси свързани със нашето гражданско общество. Преди да попитате, проверите дали въпроса не съществува вече. Може да търсите по тема, съдържание или като използвате таговете.

**Какви въпроси трябва да бъдат избягвани?**

Моля избягвайте въпроси които нямат общо със нашето общество, твърде са субективни или заядливи.

**Какво трябва да избягваме в отговорите си?**

HowTo.bg е сайт за въпроси и отговори – не е място за дебати. Моля опитайте се да не се впускате в дълго обсъждане на въпроса, за да няма разсейване от темата. Все пак за кратки дискусии могат да се използват коментарите към даден въпрос или отговор.

**Защо уведомяването по e-mail е важно?**

Изпращането на уведомителни съобщения по e-mail са много важни за успеха на нашия сайт за въпроси и отговори. Тези съобщения че държат нашите потребители в течение за:

* Въпросът им е бил отговорен
* Има коментар по дадения въпрос
* Когато други потребители зададат въпрос, отговорят, или коментират във вашата област на интерес

Успехът на HowTo.bg зависи от участието и заангажираността на потребителите, и когато се изпращат съобщения е по-вероятно, потребителите да стават активни участници в сайта, когато разбират за промени по интересуващите ги теми.  Затова изискваме валиден e-mail адрес от потребителите които искат да станат част от нашата общност.

Ако сте потребител и все още не сте потвърдили e-mail адреса си можете да го направите от [тук](/account/send-validation/ "Валидация на e-mail адреса"). Ако все още не сте член, можете да станете от [създаване на нов акаунт](/account/local/register/ "Създаване на нов акаунт")

**Кой се грижи за тази общност?**

Това си ТИ. Този сайт се управлява от потребителите. Сайта има система карма система в която потребителите могат да получат права да извършват различни дейности в зависимост от тяхното участие. Колкото повече участват толкова повече права да подобряват съдържанието на сайта имат.

**Как работи тази карма система?**

Когато се гласува за някой въпрос, потребителят който го е задал получава точки, които се казват "карма точки". Тези точки служат за груба оценка на това до колко общността има доверие във дадения потребител. Различни задачи по поддръжката ще бъдат разрешавани на потребители с определен брой точки.

Например, ако вие зададете интересен въпрос или дадете добър отговор, за тях ще бъде гласувано доверие. Ако от друга страна са подвеждащи или не са от значение, те ще бъдат санкционирани като недоверчиви. Всеки глас ще генерира 10 точки, всяка санкция ще изважда 2 точки. Има лимит от 200 точки които могат да бъдат спечелени от един въпрос. Таблицата по-долу показва какви са изискванията за карма точки за определени задачи от поддръжката.

добавяне на коментар ->  |REP_TO_COMMENT|
изтриване на коментар -> |REP_TO_DELETE_COMMENTS|
затваряне на собствен въпрос -> |REP_TO_CLOSE_OWN|
отваряне отново на собствен въпрос -> |REP_TO_REOPEN_OWN|
промяна на таговете -> |REP_TO_RETAG|
промяна по отговор -> |REP_TO_EDIT_OTHERS|
отваряне и затваряне на чужд въпрос -> |REP_TO_CLOSE_OTHERS|
изтриване на чужд коментар -> |REP_TO_DELETE_COMMENTS|

**Какво е граватар?**

Граватар означава аватар, профилна снимка разпознаваема из цялата мрежа – вашата уникална картинка асоциирана с вашата поща. Това е просто картинка която се показва на всеки ваш въпрос или коментар на сайт използващ граватар протокола. По подразбиране тя е квадратна снимка със геометрични форми приличащи на снежинка или звезда. Може да си зададете ваша картинка от gravatar.com

**Трябва ли да си създавам нов акаунт, ако искам да участвам в сайта?**

Не, не е задължително. Можете да влезете със всеки друг акаунт който ползва OpenID, тоест Google, Yahoo, AOL, и други. [Вход!](/account/signin/ "Вход")

**Защо трябва други потребители да могат да променят моите въпроси или отговори?**

Позволявайки на по-опитните потребители да променят вашите въпроси или отговори подобрява цялостното качество на информацията в сайта. Ако това не ви харесва, ще уважим вашия избор.

**Имате други въпроси?**

Моля задайте ги като въпрос в сайтa, ще се радваме да им отговорим!
""", FAQ_SET, dict(
label = _("FAQ page text"),
help_text = _("The faq page."),
widget=Textarea(attrs={'rows': '25'})))